constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          151;
        startFace       45300;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          151;
        startFace       45451;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          45602;
        startFace       45602;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          151;
        startFace       91204;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          151;
        startFace       91355;
    }
)

// ************************************************************************* //
