system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    
    y0.5
    {
        type            lineFace;
        axis            x;
        start           (0 .025 0.005);
        end             (.05 .025 0.005);
    }
    
    x0.5
    {
        type            lineFace;
        axis            y;
        start           (0.025 0 0.005);
        end             (.025 .05 0.005);
    }
    
);

fields
(
    T
    U
);


// ************************************************************************* //
